
## :white_check_mark: Apply Succeeded (dev)

[CI link](https://github.com/fumi-mura/terraform-sample/actions/runs/14926177714)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.oidc_iam_policy.data.aws_iam_policy_document.this: Reading...
module.oidc_provider.aws_iam_openid_connect_provider.this: Refreshing state... [id=arn:aws:iam::598981015011:oidc-provider/token.actions.githubusercontent.com]
module.test_2_cwlogs.aws_cloudwatch_log_group.this: Refreshing state... [id=test-2]
module.test_1_cwlogs.aws_cloudwatch_log_group.this: Refreshing state... [id=test-1]
module.oidc_iam_policy.data.aws_iam_policy_document.this: Read complete after 0s [id=1789900679]
module.oidc_iam_policy.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::598981015011:policy/dev-fumis-pf-oidc-iam-policy]
module.oidc_iam_role.data.aws_iam_policy_document.assume_role: Reading...
module.oidc_iam_role.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=777815669]
module.oidc_iam_role.aws_iam_role.this: Refreshing state... [id=dev-fumis-pf-oidc-iam-role]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.test_2_cwlogs.aws_cloudwatch_log_group.this will be destroyed
  # (because aws_cloudwatch_log_group.this is not in configuration)
  - resource "aws_cloudwatch_log_group" "this" {
      - arn               = "arn:aws:logs:ap-northeast-1:598981015011:log-group:test-2" -> null
      - id                = "test-2" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "test-2" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Name" = "test-2"
        } -> null
      - tags_all          = {
          - "Environment"        = "dev"
          - "ManagedByTerraform" = "true"
          - "Name"               = "test-2"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.test_3_cwlogs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "test-3"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name" = "test-3"
        }
      + tags_all          = {
          + "Environment"        = "dev"
          + "ManagedByTerraform" = "true"
          + "Name"               = "test-3"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
module.test_2_cwlogs.aws_cloudwatch_log_group.this: Destroying... [id=test-2]
module.test_3_cwlogs.aws_cloudwatch_log_group.this: Creating...
module.test_2_cwlogs.aws_cloudwatch_log_group.this: Destruction complete after 1s
module.test_3_cwlogs.aws_cloudwatch_log_group.this: Creation complete after 1s [id=test-3]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"apply","PRNumber":42,"Program":"tfcmt","SHA1":"f44db1f933f1c21f527b48958f9c07e1ffab80a4","Target":"dev","Vars":{},"WorkflowName":"Apply"} -->